# Pandas

## 학습목표
- 데이터 분석의 프로세스를 이해할 수 있다.
- pandas 라이브러리 개념과 기본사용법을 알 수 있다.

### Pandas
- Panel datas의 약자로 행과 열의 구조를 가지는 데이터를 다룰 때 사용하는 라이브러리
- 특징
  - Series (1차원 구조) : index + value
  - DataFrame (2차원 구조) : 행과 열을 가지는 표

In [2]:
# 라이브러리 불러오기
import pandas as pd

#### Series

In [3]:
# Series 생성하기
student = pd.Series(['A','B','C','D'])
student

0    A
1    B
2    C
3    D
dtype: object

In [4]:
# index 번호 지정하여 Series 생성 (Series 함수 내에 index 활용)
student = pd.Series(['A','B','C','D'],
                   index = [1,2,3,4])
student

1    A
2    B
3    C
4    D
dtype: object

##### Series 연산

In [5]:
# dictionary(key : index, value : value)로 데이터 생성
data = {'꼬부기' : 1256, '이브이' : 2542, '아르세우스' : 9585, '치코리타' : 100}
pokemon = pd.Series(data)
pokemon

꼬부기      1256
이브이      2542
아르세우스    9585
치코리타      100
dtype: int64

In [6]:
data2 = {'꼬부기' : 1500, '이브이' : 3000,'마자용': 200,'아르세우스' : 10000}
pokemon_up = pd.Series(data2)
pokemon_up

꼬부기       1500
이브이       3000
마자용        200
아르세우스    10000
dtype: int64

In [7]:
# index를 이름으로 지정했으므로, 이름별로 연산 진행
result = pokemon_up - pokemon
result

꼬부기      244.0
마자용        NaN
아르세우스    415.0
이브이      458.0
치코리타       NaN
dtype: float64

- index 가 동일한 데이터끼리 연산
- 결측치와의 연산 결과는 결측치 
  - 데이터 분석시 결측치가 존재하면 결측치 제거 후 진행

- 결측치 처리 방법
  - 결측치 확인 : ```변수명.isnull()``` > 결과는 논리형
  - 비어있지 않은 값만 확인 : ```변수명.notnull()```
  - 결측치 찾아 특정값으로 변경(대입) : ```변수명.fillna(원하는 값)``` > result의 결과가 직접 바뀌지 않음!
  - 삭제 : ```del 변수명``` > 삭제 후 바로 적용

In [8]:
result.isnull()

꼬부기      False
마자용       True
아르세우스    False
이브이      False
치코리타      True
dtype: bool

In [9]:
# 비어있는 값들만 출력 -> 조건 (boolean indexing)
result[result.isnull() == True]

마자용    NaN
치코리타   NaN
dtype: float64

In [10]:
# 비어있지 않은 값들
result.notnull()

꼬부기       True
마자용      False
아르세우스     True
이브이       True
치코리타     False
dtype: bool

In [11]:
result[result.notnull()==True]

꼬부기      244.0
아르세우스    415.0
이브이      458.0
dtype: float64

In [12]:
# 데이터 업데이트 > 마자용 20 결과를 업데이트(업데이트의 의미 : 새로운 값을 대입)
result['마자용'] = 20
result

꼬부기      244.0
마자용       20.0
아르세우스    415.0
이브이      458.0
치코리타       NaN
dtype: float64

In [13]:
# 데이터 추가 > 미뇽 150 추가 결과 
result['미뇽'] = 150
result

꼬부기      244.0
마자용       20.0
아르세우스    415.0
이브이      458.0
치코리타       NaN
미뇽       150.0
dtype: float64

- 업데이트 : 원래있는 인덱스 값에 새로운 값 대입
- 추가 : 새로운 인덱스에 값 대입

In [14]:
# 비어있는 Nan 에 동일값 일괄 대입
result = result.fillna(0)
result

꼬부기      244.0
마자용       20.0
아르세우스    415.0
이브이      458.0
치코리타       0.0
미뇽       150.0
dtype: float64

In [15]:
# 데이터 삭제 
del result['치코리타']
result

꼬부기      244.0
마자용       20.0
아르세우스    415.0
이브이      458.0
미뇽       150.0
dtype: float64

#### DataFrame
- DataFrame : 행과 열을 가지는 2차원 데이터

In [16]:
team = pd.DataFrame([
            ['김','ESFJ'],
            ['이','INTP'],
            ['박','ISFP'],
            ['최','INTP'],
            ['정','ESTJ'],
            ['장','INFJ']],
            columns = ['이름','MBTI'],
            index = ['001','002','003','004','005','006'])
team

    이름  MBTI
001  김  ESFJ
002  이  INTP
003  박  ISFP
004  최  INTP
005  정  ESTJ
006  장  INFJ

In [17]:
# 전치 : transpose(), 변수명.T 도 가능!
team.transpose()

       001   002   003   004   005   006
이름       김     이     박     최     정     장
MBTI  ESFJ  INTP  ISFP  INTP  ESTJ  INFJ

In [18]:
team.T

       001   002   003   004   005   006
이름       김     이     박     최     정     장
MBTI  ESFJ  INTP  ISFP  INTP  ESTJ  INFJ

In [19]:
# Dictionary 활용하여 Dataframe 생성하기
# key > columns, value > value
team_dict = {
    '이름': ['구상원', '김소은', '최보선', '신현경', '신윤지', '장지석'],
    'MBTI': ['ESFJ', 'INTP', 'ISFP', 'INTP', 'ESTJ', 'INFJ']
}

team = pd.DataFrame(
    team_dict,
    index=['001', '002', '003', '004', '005', '006']
)

team

      이름  MBTI
001  구상원  ESFJ
002  김소은  INTP
003  최보선  ISFP
004  신현경  INTP
005  신윤지  ESTJ
006  장지석  INFJ

In [20]:
team.shape,team.ndim,team.size

((6, 2), 2, 12)

In [21]:
# index 확인
team.index

Index(['001', '002', '003', '004', '005', '006'], dtype='object')

In [22]:
# column 확인
team.columns

Index(['이름', 'MBTI'], dtype='object')

In [23]:
# 정보 확인 (데이터 타입 / 결측치 확인 가능)
team.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 001 to 006
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   MBTI    6 non-null      object
dtypes: object(2)
memory usage: 144.0+ bytes

- Non-Null : 결측치 확인 -> 비어있지 않은 값들의 개수
- Dtype : 데이터 타입

## Pandas 실습
- 데이터 loading
- csv 파일 열기
- ```pd.read_csv("경로")```

In [24]:
# 한글데이터 > 인코딩 필요 
# 인코딩 감지 후 데이터 읽어오기

import chardet # 인코딩 감지 라이브러리
with open('./data/hr-info.csv','rb') as f: # 파일 열기
    data = f.read() # 파일 읽어서 변수 저장
chardet.detect(data) # 인코딩 분석

{'encoding': 'EUC-KR', 'confidence': 0.99, 'language': 'Korean'}

In [25]:
hr_info = pd.read_csv("./data/hr-info.csv",encoding = "euc-kr", index_col = "EID") #cp949도 가능
hr_info
# 특정 column을 인덱스로 만드는 방법 > index_col = "컬럼명"

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [26]:
# 요약정보 확인
hr_info.info()

<class 'pandas.core.frame.DataFrame'>
Index: 200 entries, E00206 to E00428
Data columns (total 19 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ENAME               200 non-null    object
 1   GENDER              200 non-null    object
 2   ORG_CD              197 non-null    object
 3   POS_CD              200 non-null    object
 4   AGE                 200 non-null    int64
 5   SERVICE_YEAR        200 non-null    int64
 6   EDU_LEVEL           200 non-null    object
 7   PERFORMANCE_SCORE   200 non-null    float64
 8   SALARY              200 non-null    int64
 9   LAST_PROMO_DT       182 non-null    object
 10  TRAINING_HOURS      200 non-null    int64
 11  SKILLS              200 non-null    object
 12  ACTIVE_STATE        200 non-null    object
 13  HIRE_DATE           200 non-null    object
 14  RETIRE_DATE         49 non-null     object
 15  RETIRE_REASON       49 non-null     object
 16  REHIRE_YN           49 non-null     object
 17  NATION              200 non-null    object
 18  ROUNDING_DEDUCTION  200 non-null    object
dtypes: float64(1), int64(4), object(14)
memory usage: 31.2+ KB

```
<class 'pandas.core.frame.DataFrame'>
Index: 200 entries, E00206 to E00428
Data columns (total 19 columns):
 #   Column              Non-Null Count  Dtype  
---  ------              --------------  -----  
 0   ENAME               200 non-null    object 
 1   GENDER              200 non-null    object 
 2   ORG_CD              197 non-null    object 
 3   POS_CD              200 non-null    object 
 4   AGE                 200 non-null    int64  
 5   SERVICE_YEAR        200 non-null    int64  
 6   EDU_LEVEL           200 non-null    object 
 7   PERFORMANCE_SCORE   200 non-null    float64
 8   SALARY              200 non-null    int64  
 9   LAST_PROMO_DT       182 non-null    object 
 10  TRAINING_HOURS      200 non-null    int64  
 11  SKILLS              200 non-null    object 
 12  ACTIVE_STATE        200 non-null    object 
 13  HIRE_DATE           200 non-null    object 
 14  RETIRE_DATE         49 non-null     object 
 15  RETIRE_REASON       49 non-null     object 
 16  REHIRE_YN           49 non-null     object 
 17  NATION              200 non-null    object 
 18  ROUNDING_DEDUCTION  200 non-null    object 
dtypes: float64(1), int64(4), object(14)
memory usage: 31.2+ KB
```
- 200명의 사람에 대한 19개의 열을 가지는 데이터
- 컬럼명, 데이터타입, 결측치 여부를 한눈에 확인 가능

In [27]:
hr_info.shape, hr_info.size

((200, 19), 3800)

> 데이터 분석 초반에 info, shape 등을 확인 필요!!

In [28]:
hr_info.head() # default : 5개

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y

In [29]:
hr_info.tail()

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.0,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.0,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.0,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.0,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.0,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [30]:
hr_info.columns

Index(['ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'LAST_PROMO_DT',
       'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE', 'HIRE_DATE', 'RETIRE_DATE',
       'RETIRE_REASON', 'REHIRE_YN', 'NATION', 'ROUNDING_DEDUCTION'],
      dtype='object')

### 📊 인사 데이터 컬럼 설명

본 데이터셋은 총 **200명의 직원 인사 정보**를 포함하고 있으며,  
인적 사항, 조직 정보, 근무 이력, 성과·보상, 교육, 퇴직 이력 등  
전반적인 인사 관리 데이터를 다루고 있다.

---

#### 🧑 기본 인적 정보

| 컬럼명 | 설명 |
|------|------|
| ENAME | 직원 이름 |
| GENDER | 성별 |
| AGE | 나이 |
| NATION | 국적 |

---

#### 🏢 조직 및 직무 정보

| 컬럼명 | 설명 |
|------|------|
| ORG_CD | 소속 조직 코드 (일부 결측치 존재) |
| POS_CD | 직급 코드 |
| EDU_LEVEL | 최종 학력 수준 |

---

#### 📅 근무 이력 및 재직 상태

| 컬럼명 | 설명 |
|------|------|
| HIRE_DATE | 입사일 |
| SERVICE_YEAR | 근속 연수 |
| ACTIVE_STATE | 재직 상태 (재직, 휴직, 퇴직 등) |
| LAST_PROMO_DT | 최근 승진일 (일부 결측치 존재) |

---

#### 📈 성과 및 보상 정보

| 컬럼명 | 설명 |
|------|------|
| PERFORMANCE_SCORE | 성과 평가 점수 (float) |
| SALARY | 급여 |
| ROUNDING_DEDUCTION | 급여 반올림 또는 공제 여부 |

---

#### 📚 교육 및 역량 정보

| 컬럼명 | 설명 |
|------|------|
| TRAINING_HOURS | 누적 교육 이수 시간 |
| SKILLS | 보유 기술 또는 역량 (문자열 형태) |

---

#### 🚪 퇴직 및 재입사 정보  
※ 퇴직자에 한해 값이 존재하며, 재직자의 경우 결측치로 구성됨

| 컬럼명 | 설명 |
|------|------|
| RETIRE_DATE | 퇴직일 |
| RETIRE_REASON | 퇴직 사유 |
| REHIRE_YN | 재입사 여부 |

---

- 열 가져오기

In [31]:
#직원 이름 컬럼 추출
hr_info['ENAME']

EID
E00206     시이오
E00181     나사장
E00164    난부사장
E00190     판라다
E00209     누훈봉
          ...
E00322     부탐회
E00389     초두반
E00438     권개득
E00304     탐출조
E00428     을충나
Name: ENAME, Length: 200, dtype: object

In [32]:
hr_info[['ENAME']]

       ENAME
EID
E00206   시이오
E00181   나사장
E00164  난부사장
E00190   판라다
E00209   누훈봉
...      ...
E00322   부탐회
E00389   초두반
E00438   권개득
E00304   탐출조
E00428   을충나

[200 rows x 1 columns]

In [33]:
type(hr_info['ENAME']), type(hr_info[['ENAME']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

- [] > Series 형태로 출력, [[]] > DataFrame 형태로 출력

In [34]:
hr_info[['ENAME','AGE']]

       ENAME  AGE
EID
E00206   시이오   49
E00181   나사장   49
E00164  난부사장   48
E00190   판라다   47
E00209   누훈봉   47
...      ...  ...
E00322   부탐회   23
E00389   초두반   23
E00438   권개득   23
E00304   탐출조   24
E00428   을충나   24

[200 rows x 2 columns]

- column 을 2개 이상 추출할 때는 2차원이상이므로 DataFrame 형태, 즉([[]]) 이중괄호로 추출해야함
- hr_info['ENAME','AGE'] > 행과 열의 indexing으로 인식 (그래서 에러 발생)

- 행 가져오기
  - pandas에서는 인덱싱은 column 단위만 가능!
  - 행은 slicing만 가능 (데이터는 굳이 하나하나 가져올 이유가 없음. columns은 하나하나 가져올 필요가 있지만)

In [35]:
# slicing 
hr_info['E00206':'E00164']

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.5,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.6,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.6,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y

In [36]:
# 행 슬라이싱 진행시 숫자 인덱스 활용가능
hr_info[0:5]

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y

In [37]:
# EID가 E00206인 사람만 가져오기
hr_info[hr_info.index == 'E00206']

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.5,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y

- DataFrame 연산
  - 행단위, 열단위 연산이 가능

In [38]:
# 연봉 데이터를 추출하여 월 급여 계산
(hr_info[['SALARY']]/12).round(2)

        SALARY
EID
E00206  850.00
E00181  791.67
E00164  758.33
E00190  708.33
E00209  716.67
...        ...
E00322  375.00
E00389  375.00
E00438  375.00
E00304  375.00
E00428  375.00

[200 rows x 1 columns]

In [39]:
# 비교연산 
hr_info['SALARY'] >= 5000

EID
E00206     True
E00181     True
E00164     True
E00190     True
E00209     True
          ...
E00322    False
E00389    False
E00438    False
E00304    False
E00428    False
Name: SALARY, Length: 200, dtype: bool

In [40]:
hr_info[hr_info[['SALARY']] >= 5000] # [[]] Dataframe으로 뽑으면 column만 확인하고 나머지는 NaN 값으로 출력

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10200.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00181,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9100.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00190,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00209,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8600.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00389,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00438,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00304,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
E00428,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
hr_info[hr_info['SALARY'] >= 5000]

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00460,춘란시,M,ORG023,P008,29,0,학사 학위,0.00,5000,2024-03-01,4,"Data Analysis, Python",N,2024-03-01,2024-05-01,이직,N,KOREA,N
E00468,다덕출,F,ORG028,P008,29,0,학사 학위,0.00,5000,2024-03-01,4,"Java, Project Management, Salesforce",Y,2024-03-01,NaN,NaN,NaN,KOREA,N
E00469,리모루,M,ORG014,P008,29,0,학사 학위,0.00,5000,2024-03-01,4,Project Management,Y,2024-03-01,NaN,NaN,NaN,India,N
E00471,문예성,M,ORG013,P008,29,0,학사 학위,0.00,5000,2024-03-01,4,"Project Management, Marketing, Java",Y,2024-03-01,NaN,NaN,NaN,USA,N
E00484,개장영,F,ORG007,P008,29,0,학사 학위,0.00,5000,2024-03-01,4,Data Analysis,Y,2024-03-01,NaN,NaN,NaN,India,N

In [42]:
# 연봉 5000이상인 사람의 이름
hr_info[hr_info['SALARY'] >= 5000]['ENAME']

EID
E00206     시이오
E00181     나사장
E00164    난부사장
E00190     판라다
E00209     누훈봉
          ...
E00460     춘란시
E00468     다덕출
E00469     리모루
E00471     문예성
E00484     개장영
Name: ENAME, Length: 182, dtype: object

- hr_info[hr_info['SALARY'] >= 5000] 이 자체가 dataframe 이므로 여기서 ['ENAME']을 다시 인덱싱한다고 생각해도 됨!

- 문자열 변경 (DataFrame, Series에 문자열 함수를 적용하는 방법)

In [43]:
string = "박사 학위"
string.replace(" 학위","")

'박사'

In [44]:
string

'박사 학위'

In [45]:
# 박사 학위 -> 박사
hr_info['EDU_LEVEL'].replace(" 학위","") # 이 자체로는 적용 안됨.

EID
E00206    박사 학위
E00181    박사 학위
E00164    박사 학위
E00190    박사 학위
E00209    박사 학위
          ...
E00322    학사 학위
E00389    학사 학위
E00438    학사 학위
E00304    학사 학위
E00428    학사 학위
Name: EDU_LEVEL, Length: 200, dtype: object

In [46]:
hr_info['EDU_LEVEL'].str.replace(" 학위","")
# 원본데이터를 훼손하지 않음

EID
E00206    박사
E00181    박사
E00164    박사
E00190    박사
E00209    박사
          ..
E00322    학사
E00389    학사
E00438    학사
E00304    학사
E00428    학사
Name: EDU_LEVEL, Length: 200, dtype: object

## DataFrame 예제
- BMI 지수 계산
- BMI = 몸무게(kg) / 키(m)**2

In [47]:
# 한글데이터 > 인코딩 필요 
# 인코딩 감지 후 데이터 읽어오기

import chardet # 인코딩 감지 라이브러리
with open('data/육군신체측정정보.csv','rb') as f: # 파일 열기
    data = f.read() # 파일 읽어서 변수 저장
chardet.detect(data) # 인코딩 분석

{'encoding': 'utf-8', 'confidence': 0.99, 'language': ''}

In [48]:
data = pd.read_csv("data/육군신체측정정보.csv", encoding = "utf-8" , index_col="순번") #index_col : 인덱스 재정의
data.head()

C:\Users\ChoiSeokjin\AppData\Local\Temp\ipykernel_2304\1605579753.py:1: DtypeWarning: Columns (2,3,5,6,7,8) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv("data/육군신체측정정보.csv", encoding = "utf-8" , index_col="순번") #index_col : 인덱스 재정의

,측정 일자,가슴 둘레 센티미터,소매길이 센티미터,신장 센티미터,허리 둘레 센티미터,샅높이 센티미터,머리 둘레 센티미터,발 길이 센티미터,몸무게 킬로그램
순번,,,,,,,,,
1,20140106,96.3,92.6,185.5 cm,82.5,83.8,57.1,28.5,73.2 kg
2,2013,101.9,83.8,167.2 cm,81.2,74.4,55.0,24.2,65.1 kg
3,20140106,99.5,89.6,179.9 cm,99.2,84.2,56.3,28.1,93.2 kg
4,2013,98.6,85.5,171.4 cm,85.9,76.4,54.5,27.4,71.6 kg
5,20140106,94.7,88.1,176.9 cm,78.3,79.7,58.5,26.5,67.1 kg

- column에 데이터타입이 섞여있음!

In [49]:
data.info() # 반드시 해야함!!

<class 'pandas.core.frame.DataFrame'>
Index: 167983 entries, 1 to 167983
Data columns (total 9 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   측정 일자       167983 non-null  int64
 1   가슴 둘레 센티미터  167982 non-null  object
 2   소매길이 센티미터   167983 non-null  object
 3   신장 센티미터     167983 non-null  object
 4   허리 둘레 센티미터  167983 non-null  object
 5   샅높이 센티미터    167983 non-null  object
 6   머리 둘레 센티미터  167981 non-null  object
 7   발 길이 센티미터   167983 non-null  object
 8   몸무게 킬로그램    167983 non-null  object
dtypes: int64(1), object(8)
memory usage: 12.8+ MB

- object > 문자열 형태 (필요 데이터)
  - 신장 센티미터
  - 몸무게

##### **결과를 확인하고 변수에 담기!!!**

In [50]:
data.columns

Index(['측정 일자', '가슴 둘레 센티미터', '소매길이 센티미터', '신장 센티미터', '허리 둘레 센티미터', '샅높이 센티미터',
       '머리 둘레 센티미터', '발 길이 센티미터', '몸무게 킬로그램'],
      dtype='object')

- 키데이터 추출

In [51]:
h = data['신장 센티미터']
h

순번
1         185.5 cm
2         167.2 cm
3         179.9 cm
4         171.4 cm
5         176.9 cm
            ...
167979    173.2 cm
167980    166.3 cm
167981    175.2 cm
167982    173.6 cm
167983    175.8 cm
Name: 신장 센티미터, Length: 167983, dtype: object

- cm 제거 => float 형태로 변경

In [52]:
h = h.str.replace(" cm","").astype(float)/100
h

순번
1         1.855
2         1.672
3         1.799
4         1.714
5         1.769
          ...
167979    1.732
167980    1.663
167981    1.752
167982    1.736
167983    1.758
Name: 신장 센티미터, Length: 167983, dtype: float64

- kg 삭제

In [53]:
w = data['몸무게 킬로그램'].str.replace(" kg","").astype(float)

In [54]:
BMI = w/h**2
BMI

순번
1         21.272731
2         23.286726
3         28.797420
4         24.372012
5         21.442077
            ...
167979    24.568108
167980    25.564359
167981    25.639322
167982    19.046380
167983    16.728338
Length: 167983, dtype: float64

In [55]:
BMI.round(2)

순번
1         21.27
2         23.29
3         28.80
4         24.37
5         21.44
          ...
167979    24.57
167980    25.56
167981    25.64
167982    19.05
167983    16.73
Length: 167983, dtype: float64

- pandas도 요소별 연산이 가능!!

### Boolean 인덱싱 
- 인덱스 번호가 아닌 `조건`을 중심으로 데이터를 추출하는 방법
- 비교 연산의 결과가 True인 값들만 추출
- 데이터변수명[조건]

In [56]:
# 키가 1.7이상인 데이터만 추출
h[h>=1.7]

순번
1         1.855
3         1.799
4         1.714
5         1.769
6         1.805
          ...
167978    1.733
167979    1.732
167981    1.752
167982    1.736
167983    1.758
Name: 신장 센티미터, Length: 135170, dtype: float64

In [57]:
hr_info

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [58]:
hr_info[hr_info['GENDER'] == "F"]

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00298,포난서,F,ORG021,P004,47,19,석사 학위,3.63,8500,2023-03-01,47,Data Analysis,Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00487,고명초,F,ORG014,P004,47,20,석사 학위,1.81,8600,2022-03-01,49,"Marketing, Salesforce, Project Management",Y,2004-03-01,NaN,NaN,NaN,Japan,Y
E00294,중우방,F,ORG021,P004,48,19,박사 학위,2.56,8600,2023-03-01,12,"Python, Salesforce, Java",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00382,망팽단,F,ORG026,P009,22,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00189,초옥덕,F,ORG020,P009,23,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

- 파이썬 라이브러리에서는 and, or 키워드 대신 & | 를 사용한다

In [59]:
# 학위 석사 이상
hr_info['EDU_LEVEL'] == "박사 학위"

EID
E00206     True
E00181     True
E00164     True
E00190     True
E00209     True
          ...
E00322    False
E00389    False
E00438    False
E00304    False
E00428    False
Name: EDU_LEVEL, Length: 200, dtype: bool

In [60]:
(hr_info['EDU_LEVEL'] == "박사 학위") | (hr_info['EDU_LEVEL'] == "석사 학위") 
#괄호로 어디까지 비교 연산자인지 묶어줘야함
# 비교 연산자는 앞에서 뒤로 흘러감

EID
E00206     True
E00181     True
E00164     True
E00190     True
E00209     True
          ...
E00322    False
E00389    False
E00438    False
E00304    False
E00428    False
Name: EDU_LEVEL, Length: 200, dtype: bool

In [61]:
hr_info[(hr_info['EDU_LEVEL'] == "박사 학위") | (hr_info['EDU_LEVEL'] == "석사 학위")]

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00298,포난서,F,ORG021,P004,47,19,석사 학위,3.63,8500,2023-03-01,47,Data Analysis,Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00487,고명초,F,ORG014,P004,47,20,석사 학위,1.81,8600,2022-03-01,49,"Marketing, Salesforce, Project Management",Y,2004-03-01,NaN,NaN,NaN,Japan,Y
E00294,중우방,F,ORG021,P004,48,19,박사 학위,2.56,8600,2023-03-01,12,"Python, Salesforce, Java",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00346,루신디,F,ORG011,P004,48,19,석사 학위,1.25,8500,2023-03-01,83,Python,Y,2005-03-01,NaN,NaN,NaN,USA,Y
E00411,구류길,M,ORG004,P004,48,18,박사 학위,4.87,8500,2024-03-01,37,"Data Analysis, Java, Python",Y,2006-03-01,NaN,NaN,NaN,USA,Y
E00167,명묵말,M,ORG013,P005,42,12,석사 학위,3.88,7300,2024-03-01,46,Salesforce,Y,2012-03-01,NaN,NaN,NaN,KOREA,Y
E00207,초디소,M,ORG030,P005,41,11,석사 학위,4.38,7200,2023-03-01,17,"Java, Project Management",N,2011-03-01,2022-02-28,이직,N,KOREA,Y
E00210,봉묵정,M,ORG006,P005,41,14,박사 학위,2.65,7600,2022-03-01,46,"Salesforce, Marketing, Data Analysis",Y,2010-03-01,NaN,NaN,NaN,KOREA,Y
E00258,처록신,M,ORG016,P005,40,13,박사 학위,1.97,7500,2023-03-01,12,"Salesforce, Data Analysis, Project Management",Y,2011-03-01,NaN,NaN,NaN,KOREA,Y
E00260,녹덕익,M,ORG002,P005,40,14,석사 학위,2.71,7500,2022-03-01,62,Salesforce,Y,2010-03-01,NaN,NaN,NaN,KOREA,Y
E00323,묵단언,F,ORG022,P005,40,11,석사 학위,2.95,7200,2023-03-01,79,Data Analysis,N,2011-03-01,2023-02-28,개인 사유,Y,Japan,Y
E00445,속묵우,M,ORG002,P006,35,9,석사 학위,3.06,7000,2022-03-01,87,Salesforce,N,2015-03-01,2024-02-29,이직,N,UK,Y
E00176,자웅유,F,ORG003,P006,36,9,석사 학위,1.16,7000,2022-03-01,2,Java,Y,2015-03-01,NaN,NaN,NaN,KOREA,Y
E00370,매혁지,M,ORG027,P006,36,6,석사 학위,2.62,6700,2024-03-01,83,"Project Management, Salesforce, Java",N,2017-03-01,2023-02-28,개인 사유,N,UK,Y
E00423,강회나,F,ORG007,P006,36,9,박사 학위,3.97,7100,2022-03-01,88,"Marketing, Java, Project Management",Y,2015-03-01,NaN,NaN,NaN,Japan,Y
E00221,황하예,M,ORG010,P006,37,8,박사 학위,4.96,7000,2023-03-01,80,"Python, Marketing, Project Management",Y,2016-03-01,NaN,NaN,NaN,KOREA,Y
E00373,설홍윤,F,ORG006,P006,37,9,석사 학위,2.13,7000,2022-03-01,82,"Project Management, Java, Marketing",Y,2015-03-01,NaN,NaN,NaN,Japan,Y
E00379,권철희,F,ORG005,P006,39,8,석사 학위,1.55,6900,2023-03-01,61,"Python, Java, Data Analysis",N,2016-03-01,2021-02-28,개인 사유,N,India,Y
E00396,빈국초,F,ORG014,P007,29,1,석사 학위,2.60,5700,2024-03-01,84,"Python, Java",Y,2023-03-01,NaN,NaN,NaN,USA,Y
E00259,규창형,M,ORG007,P007,31,1,석사 학위,3.79,5700,2024-03-01,54,"Java, Project Management",Y,2023-03-01,NaN,NaN,NaN,KOREA,Y
E00406,철복다,F,ORG012,P007,28,1,석사 학위,4.36,5700,2024-03-01,73,Java,Y,2023-03-01,NaN,NaN,NaN,USA,Y
E00480,혁노력,M,ORG025,P007,30,1,박사 학위,3.97,5800,2024-03-01,84,Project Management,N,2023-03-01,2024-03-01,이직,N,UK,Y
E00321,반함훼,M,ORG013,P007,30,1,석사 학위,1.07,5700,2024-03-01,55,"Marketing, Python, Java",N,2023-03-01,2024-03-01,이직,N,USA,Y
E00424,선유성,M,ORG020,P008,28,0,석사 학위,0.00,5100,2024-03-01,4,"Project Management, Java, Marketing",Y,2024-03-01,NaN,NaN,NaN,India,N

### 데이터 색인(심화) : 인덱서(loc,iloc)
- 행과 열의 범위를 설정하여 데이터를 추출
- ```df.loc[행범위,열범위]``` : 컬럼명, 인덱스명 통해서 추출(이름을 직접 사용해야함!)
- ```df.iloc[행범위,열범위]``` : 인덱스 번호를 통해서 추출
- loc,iloc 인덱싱을 통해 `행 인덱싱`이 가능해짐

In [62]:
hr_info.loc['E00206':'E00164','ENAME':'AGE']

       ENAME GENDER ORG_CD POS_CD  AGE
EID
E00206   시이오      M    NaN   P001   49
E00181   나사장      F    NaN   P002   49
E00164  난부사장      M    NaN   P003   48

In [63]:
hr_info.iloc[0:3,0:5]

       ENAME GENDER ORG_CD POS_CD  AGE
EID
E00206   시이오      M    NaN   P001   49
E00181   나사장      F    NaN   P002   49
E00164  난부사장      M    NaN   P003   48

In [64]:
hr_info.iloc[:3,:5] #처음부터면 0 생략가능!

       ENAME GENDER ORG_CD POS_CD  AGE
EID
E00206   시이오      M    NaN   P001   49
E00181   나사장      F    NaN   P002   49
E00164  난부사장      M    NaN   P003   48

In [65]:
# 모든 사람의 age ~ salary 까지 > iloc 사용
hr_info.iloc[:,4:9]

        AGE  SERVICE_YEAR EDU_LEVEL  PERFORMANCE_SCORE  SALARY
EID
E00206   49            25     박사 학위               4.50   10200
E00181   49            24     박사 학위               4.60    9500
E00164   48            22     박사 학위               4.60    9100
E00190   47            18     박사 학위               3.51    8500
E00209   47            19     박사 학위               3.38    8600
...     ...           ...       ...                ...     ...
E00322   23             0     학사 학위               0.00    4500
E00389   23             0     학사 학위               0.00    4500
E00438   23             0     학사 학위               0.00    4500
E00304   24             0     학사 학위               0.00    4500
E00428   24             0     학사 학위               0.00    4500

[200 rows x 5 columns]

In [66]:
# 모든 사람의 age ~ salary 까지 > iloc 사용
hr_info.loc[:,"AGE":"SALARY"]

        AGE  SERVICE_YEAR EDU_LEVEL  PERFORMANCE_SCORE  SALARY
EID
E00206   49            25     박사 학위               4.50   10200
E00181   49            24     박사 학위               4.60    9500
E00164   48            22     박사 학위               4.60    9100
E00190   47            18     박사 학위               3.51    8500
E00209   47            19     박사 학위               3.38    8600
...     ...           ...       ...                ...     ...
E00322   23             0     학사 학위               0.00    4500
E00389   23             0     학사 학위               0.00    4500
E00438   23             0     학사 학위               0.00    4500
E00304   24             0     학사 학위               0.00    4500
E00428   24             0     학사 학위               0.00    4500

[200 rows x 5 columns]

```hr_info.loc["AGE":"SALARY"]``` > 전체행이라고 "행" 을 생략하면 안됨.

In [68]:
hr_info.iloc[0:7,1:7]

       GENDER  ORG_CD POS_CD  AGE  SERVICE_YEAR EDU_LEVEL
EID
E00206      M     NaN   P001   49            25     박사 학위
E00181      F     NaN   P002   49            24     박사 학위
E00164      M     NaN   P003   48            22     박사 학위
E00190      F  ORG007   P004   47            18     박사 학위
E00209      M  ORG023   P004   47            19     박사 학위
E00242      M  ORG027   P004   47            18     학사 학위
E00298      F  ORG021   P004   47            19     석사 학위

In [70]:
hr_info.iloc[:3] #comma를 작성해주지 않으면 행단위로 인덱싱이 가능

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.5,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.6,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.6,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y

#### 데이터 삽입, 삭제, 추가...

- columns 추가
  - df.insert(loc = 인덱스, column = 추가할 컬럼명, value = 데이터)
  - loc 속성에 작성한 인덱스 자리에 삽입 -> 그 이후 데이터는 뒤로 밀리게 됨
  - df['새로운 컬럼명'] = 데이터

In [73]:
#'MONTHLY_PAY' 추가
hr_info.insert(loc = 9, column = 'MONTHLY_PAY', value = hr_info['SALARY']/12)
hr_info

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,MONTHLY_PAY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,850.000000,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,791.666667,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,758.333333,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,708.333333,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,716.666667,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,375.000000,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,375.000000,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,375.000000,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,375.000000,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,375.000000,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [79]:
#'MONTHLY_PAY' 추가 > 이렇게 추가해도 됨!
hr_info['DAILY_PAY'] = hr_info['MONTHLY_PAY']/30
hr_info

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,MONTHLY_PAY,...,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION,MONTHLY_PAY_,DAILY_PAY
EID,,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,850.000000,...,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y,850.000000,28.333333
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,791.666667,...,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y,791.666667,26.388889
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,758.333333,...,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y,758.333333,25.277778
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,708.333333,...,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y,708.333333,23.611111
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,716.666667,...,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y,716.666667,23.888889
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,375.000000,...,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.500000
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,375.000000,...,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.500000
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,375.000000,...,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.500000
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,375.000000,...,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.500000
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,375.000000,...,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.500000

- 데이터 수정
  - df['존재하는 컬럼명'] = 업데이트할 데이터

In [85]:
hr_info['DAILY_PAY'] = (hr_info['MONTHLY_PAY']/30).round(2)
hr_info

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,MONTHLY_PAY,...,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION,MONTHLY_PAY_,DAILY_PAY
EID,,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,850.000000,...,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y,850.000000,28.33
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,791.666667,...,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y,791.666667,26.39
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,758.333333,...,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y,758.333333,25.28
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,708.333333,...,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y,708.333333,23.61
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,716.666667,...,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y,716.666667,23.89
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,375.000000,...,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.50
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,375.000000,...,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.50
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,375.000000,...,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.50
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,375.000000,...,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.50
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,375.000000,...,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.000000,12.50

- 행(row) 추가
  - df.loc['추가하고 싶은 인덱스'] = [데이터]
  - 추가할 데이터에 들어가는 특성의 개수(column 개수)를 맞춰줘야 한다.
  - 사실 거의 하지 않음. (새로운 데이터가 들어올 때)

In [77]:
hr_info.columns # column 명 확인

Index(['ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'MONTHLY_PAY',
       'LAST_PROMO_DT', 'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE',
       'HIRE_DATE', 'RETIRE_DATE', 'RETIRE_REASON', 'REHIRE_YN', 'NATION',
       'ROUNDING_DEDUCTION', 'MONTHLY_PAY_'],
      dtype='object')

In [82]:
hr_info['NATION'].unique()

array(['KOREA', 'Japan', 'USA', 'India', 'China', 'UK'], dtype=object)